#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameOverlay

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameOverlay.WBP_GameOverlay_C.ExecuteUbergraph_WBP_GameOverlay
// 0x0E10 (0x0E10 - 0x0000)
struct WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFreeCamMode                                  Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00C0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_1;                              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x00E0(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0118(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_2;                              // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_3;                              // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable_11;                             // 0x0148(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0160(0x0018)()
	bool                                          Temp_bool_Variable_8;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_4;                              // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_5;                              // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_13;                             // 0x0180(0x0018)()
	float                                         CallFunc_BreakVector2D_X;                          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x01CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_19;                            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_18;                            // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_SlomoSpeed;                           // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInvertSpeed;                         // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSlomoEnabled;                        // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPaused;                            // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF[0x1];                                      // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_17;                            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewAmount;                            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AmountAdded;                          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_NumberToText_ReturnValue;                 // 0x0220(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot;                 // 0x0238(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0240(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_NumberToText_ReturnValue_1;               // 0x0280(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0298(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ReferenceParm)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_1;               // 0x0340(0x0008)(NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0348(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_16;                            // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInFreeCam;                         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFreeCamMode                                  K2Node_Event_InFreeCamMode;                        // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFixedCam;                          // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B[0x1];                                      // 0x036B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_2;               // 0x036C(0x0008)(NoDestructor)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0378(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0390(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x03B0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x03F8(0x0018)()
	bool                                          Temp_bool_Variable_14;                             // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0418(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0458(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default_3;                           // 0x0468(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0480(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0498(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_4;                           // 0x04D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x04F0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0500(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0540(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0558(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0570(0x0040)(HasGetValueTypeHash)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_15;                            // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x05B8(0x0010)(ReferenceParm)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_3;               // 0x05C8(0x0008)(NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x05D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x05E8(0x0018)()
	class UMatchTimerWidget*                      K2Node_Event_Widget_14;                            // 0x0600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_13;                            // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_CameraDisplayName;                    // 0x0610(0x0018)(ConstParm)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_4;               // 0x0628(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0630(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0670(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_12;                            // 0x0688(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_VehicleDisplayName;                   // 0x0690(0x0018)(ConstParm)
	bool                                          K2Node_Event_bIsDownloading;                       // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Progress;                             // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x06B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x06F0(0x0010)(ReferenceParm)
	float                                         K2Node_Select_Default_5;                           // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0708(0x0018)()
	class FText                                   CallFunc_NumberToText_ReturnValue_2;               // 0x0720(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0738(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x0778(0x0040)(HasGetValueTypeHash)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_5;               // 0x07B8(0x0008)(NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x07C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x07D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x07E8(0x0018)()
	class UInputHelpWidget*                       K2Node_Event_Widget_11;                            // 0x0800(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0808(0x0040)(HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0848(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0850(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0860(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x0878(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x08B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x08C8(0x0018)()
	class UChatWidget*                            K2Node_Event_Widget_10;                            // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x08E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x08F0(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0900(0x0010)(NoDestructor)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_9;                             // 0x0910(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess;                             // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsAutoSave;                          // 0x0919(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91A[0x6];                                      // 0x091A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_6;                           // 0x0920(0x0018)()
	int32                                         K2Node_Select_Default_7;                           // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_8;                           // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_9;                           // 0x093D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93E[0x2];                                      // 0x093E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_10;                          // 0x0940(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_8;                             // 0x0958(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewSpeedRatio;                        // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMaxSpeed;                          // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_11;                          // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96C[0x4];                                      // 0x096C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NumberToText_ReturnValue_3;               // 0x0970(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_6;               // 0x0988(0x0008)(NoDestructor)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_7;                             // 0x0990(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewZoomRatio;                         // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99C[0x4];                                      // 0x099C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NumberToText_ReturnValue_4;               // 0x09A0(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_7;               // 0x09B8(0x0008)(NoDestructor)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_8;               // 0x09C0(0x0008)(NoDestructor)
	class UMatchStateWidget*                      K2Node_Event_Widget_6;                             // 0x09C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTeamScoreWidget*                       K2Node_Event_Widget_5;                             // 0x09D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 K2Node_Event_TeamAttitude;                         // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x09D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9DA[0x6];                                      // 0x09DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x09E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_4;                             // 0x09E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHUDVisibility                                K2Node_Event_NewVisibility;                        // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F1[0x7];                                      // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_3;                             // 0x09F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECameraMode                                   K2Node_Event_NewMode;                              // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHUDVisibilityDisplayText_ReturnValue;  // 0x0A08(0x0018)()
	class FText                                   CallFunc_GetCameraModeDisplayText_ReturnValue;     // 0x0A20(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x0A38(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_15;           // 0x0A78(0x0040)(HasGetValueTypeHash)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_9;               // 0x0AB8(0x0008)(NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0AC0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0AD8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0AF0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_16;           // 0x0B08(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_17;           // 0x0B48(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0B88(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_9;                          // 0x0B98(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0BA8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_9;                     // 0x0BC0(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_10;              // 0x0BD8(0x0008)(NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_6;                              // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_2;                             // 0x0BE8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0BF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF1[0x3];                                      // 0x0BF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_11;              // 0x0BF4(0x0008)(NoDestructor)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0C00(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x0C18(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_18;           // 0x0C30(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x0C70(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_12;              // 0x0C88(0x0008)(NoDestructor)
	class FText                                   K2Node_Select_Default_12;                          // 0x0C90(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_1;                             // 0x0CA8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Message;                              // 0x0CB0(0x0018)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_19;           // 0x0CC8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_10;                         // 0x0D08(0x0010)(ReferenceParm)
	class UHUDNotificationWidget*                 K2Node_Event_Widget;                               // 0x0D18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Remaining;                            // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D24[0x4];                                      // 0x0D24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_10;                    // 0x0D28(0x0018)()
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0D40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0D44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0D48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D49[0x7];                                      // 0x0D49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NumberToText_ReturnValue_5;               // 0x0D50(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_20;           // 0x0D68(0x0040)(HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_13;                          // 0x0DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA9[0x7];                                      // 0x0DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_11;                         // 0x0DB0(0x0010)(ReferenceParm)
	EBrickUIColorStyle                            Temp_byte_Variable_7;                              // 0x0DC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC1[0x7];                                      // 0x0DC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_11;                    // 0x0DC8(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_13;              // 0x0DE0(0x0008)(NoDestructor)
	EBrickUIColorStyle                            K2Node_Select_Default_14;                          // 0x0DE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE9[0x7];                                      // 0x0DE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0DF0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0DF8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         K2Node_Select_Default_15;                          // 0x0E00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0E08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay) == 0x000008, "Wrong alignment on WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay");
static_assert(sizeof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay) == 0x000E10, "Wrong size on WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, EntryPoint) == 0x000000, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable) == 0x000008, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_1) == 0x000020, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable) == 0x000038, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_float_Variable) == 0x00003C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable) == 0x000040, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_2) == 0x000048, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_3) == 0x000060, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_4) == 0x000078, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_5) == 0x000090, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_6) == 0x0000A8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_7) == 0x0000C0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_1) == 0x0000D8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_1) == 0x0000D9, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_2) == 0x0000DA, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_8) == 0x0000E0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_3) == 0x0000F8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_9) == 0x000100, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_10) == 0x000118, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_4) == 0x000130, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_int_Variable) == 0x000134, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_5) == 0x000138, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_int_Variable_1) == 0x00013C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_int_Variable_2) == 0x000140, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_6) == 0x000144, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_2) == 0x000145, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_3) == 0x000146, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_7) == 0x000147, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_11) == 0x000148, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_12) == 0x000160, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_8) == 0x000178, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_9) == 0x000179, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_10) == 0x00017A, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_11) == 0x00017B, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_4) == 0x00017C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_5) == 0x00017D, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_12) == 0x00017E, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_13) == 0x000180, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X) == 0x000198, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y) == 0x00019C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X_1) == 0x0001A0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y_1) == 0x0001A4, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_13) == 0x0001A8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_Margin) == 0x0001AC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X_2) == 0x0001BC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y_2) == 0x0001C0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X_3) == 0x0001C4, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y_3) == 0x0001C8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_Margin_1) == 0x0001CC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_19) == 0x0001E0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_19' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Index) == 0x0001E8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_18) == 0x0001F0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_18' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_SlomoSpeed) == 0x0001F8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_SlomoSpeed' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bInvertSpeed) == 0x0001FC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bInvertSpeed' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bSlomoEnabled) == 0x0001FD, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bSlomoEnabled' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bIsPaused) == 0x0001FE, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bIsPaused' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_17) == 0x000200, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_17' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_NewAmount) == 0x000208, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_NewAmount' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_AmountAdded) == 0x00020C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_AmountAdded' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_SelectInt_ReturnValue) == 0x000210, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000214, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_SelectInt_ReturnValue_1) == 0x000218, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_SelectInt_ReturnValue_2) == 0x00021C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_NumberToText_ReturnValue) == 0x000220, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_NumberToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot) == 0x000238, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData) == 0x000240, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_NumberToText_ReturnValue_1) == 0x000280, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_NumberToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Conv_FloatToText_ReturnValue) == 0x000298, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002B0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002F0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeArray_Array) == 0x000330, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot_1) == 0x000340, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Format_ReturnValue) == 0x000348, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_16) == 0x000360, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_16' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bIsInFreeCam) == 0x000368, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bIsInFreeCam' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_InFreeCamMode) == 0x000369, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_InFreeCamMode' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bIsFixedCam) == 0x00036A, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bIsFixedCam' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot_2) == 0x00036C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default) == 0x000378, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_1) == 0x000390, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003A8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_3) == 0x0003B0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BooleanAND_ReturnValue) == 0x0003F0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_2) == 0x0003F8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_14) == 0x000410, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_4) == 0x000418, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeArray_Array_1) == 0x000458, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_3) == 0x000468, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Format_ReturnValue_1) == 0x000480, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_5) == 0x000498, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_4) == 0x0004D8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeArray_Array_2) == 0x0004F0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_6) == 0x000500, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Format_ReturnValue_2) == 0x000540, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Format_ReturnValue_2' has a wrong offset!");
